zevero/avr_boot/avr/boards.txt
avr_boot_atmega32u4.menu.SDCS.8=8
avr_boot_atmega32u4.menu.SDCS.8.cs_pin=8

avr_boot_atmega32u4.menu.SDCS.10=10
avr_boot_atmega32u4.menu.SDCS.10.cs_pin=10

# BOD Menu
avr_boot_atmega32u4.menu.BOD.2_6=2.6V
avr_boot_atmega32u4.menu.BOD.2_6.bootloader.extended_fuses=0xCB

avr_boot_atmega32u4.menu.BOD.4_3=4.3V
avr_boot_atmega32u4.menu.BOD.4_3.bootloader.extended_fuses=0xF8

avr_boot_atmega32u4.menu.BOD.3_5=3.5V
avr_boot_atmega32u4.menu.BOD.3_5.bootloader.extended_fuses=0xF9

avr_boot_atmega32u4.menu.BOD.3_4=3.4V
avr_boot_atmega32u4.menu.BOD.3_4.bootloader.extended_fuses=0xFA

avr_boot_atmega32u4.menu.BOD.2_4=2.4V
avr_boot_atmega32u4.menu.BOD.2_4.bootloader.extended_fuses=0xFC

avr_boot_atmega32u4.menu.BOD.2_2=2.2V
avr_boot_atmega32u4.menu.BOD.2_2.bootloader.extended_fuses=0xFD

avr_boot_atmega32u4.menu.BOD.2_0=2.0V
avr_boot_atmega32u4.menu.BOD.2_0.bootloader.extended_fuses=0xFE

avr_boot_atmega32u4.menu.BOD.off=Off
avr_boot_atmega32u4.menu.BOD.off.bootloader.extended_fuses=0xFF

avr_boot_atmega32u4.bootloader.file={build.mcu}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

avr_boot_atmega1284.name=ATmega1284/P

avr_boot_atmega1284.upload.tool=arduino:avrdude
avr_boot_atmega1284.upload.maximum_data_size=16384
avr_boot_atmega1284.upload.maximum_size=126976

avr_boot_atmega1284.bootloader.tool=arduino:avrdude
avr_boot_atmega1284.bootloader.high_fuses=0xDA
avr_boot_atmega1284.bootloader.unlock_bits=0x3F
avr_boot_atmega1284.bootloader.lock_bits=0x0F

avr_boot_atmega1284.build.core=arduino:arduino
avr_boot_atmega1284.build.board=AVR_ATMEGA1284

# Processor Menu
avr_boot_atmega1284.menu.cpu.atmega1284p=ATmega1284P
avr_boot_atmega1284.menu.cpu.atmega1284p.build.mcu=atmega1284p

avr_boot_atmega1284.menu.cpu.atmega1284=ATmega1284
avr_boot_atmega1284.menu.cpu.atmega1284.build.mcu=atmega1284

# Pinout Menu
avr_boot_atmega1284.menu.pinout.avrdevelopers=avr-developers.com
avr_boot_atmega1284.menu.pinout.avrdevelopers.build.variant=avr_developers
avr_boot_atmega1284.menu.pinout.avrdevelopers.build.board=1284P_AVR_DEVELOPERS
avr_boot_atmega1284.menu.pinout.avrdevelopers.variant_id=0

avr_boot_atmega1284.menu.pinout.calunium_pcb=Calunium PCB
avr_boot_atmega1284.menu.pinout.calunium_pcb.build.variant=calunium-pcb
avr_boot_atmega1284.menu.pinout.calunium_pcb.build.board=AVR_CALUNIUM
avr_boot_atmega1284.menu.pinout.calunium_pcb.variant_id=2

avr_boot_atmega1284.menu.pinout.calunium_stripboard=Calunium Stripboard
avr_boot_atmega1284.menu.pinout.calunium_stripboard.build.variant=calunium-stripboard
avr_boot_atmega1284.menu.pinout.calunium_stripboard.build.board=AVR_CALUNIUM
avr_boot_atmega1284.menu.pinout.calunium_stripboard.variant_id=2

avr_boot_atmega1284.menu.pinout.goldilocks=Goldilocks v1.1/Analogue
avr_boot_atmega1284.menu.pinout.goldilocks.build.variant=goldilocks
avr_boot_atmega1284.menu.pinout.goldilocks.build.board=AVR_GOLDILOCKS
avr_boot_atmega1284.menu.pinout.goldilocks.variant_id=3

avr_boot_atmega1284.menu.pinout.wildfirev2=WildFire v2
avr_boot_atmega1284.menu.pinout.wildfirev2.build.variant=wildfirev2
avr_boot_atmega1284.menu.pinout.wildfirev2.build.board=WILDFIRE_V2
avr_boot_atmega1284.menu.pinout.wildfirev2.variant_id=3

avr_boot_atmega1284.menu.pinout.wildfirev3=WildFire v3
avr_boot_atmega1284.menu.pinout.wildfirev3.build.variant=wildfirev3
avr_boot_atmega1284.menu.pinout.wildfirev3.build.board=WILDFIRE_V3
avr_boot_atmega1284.menu.pinout.wildfirev3.variant_id=4

avr_boot_atmega1284.menu.pinout.wirings=Wiring S
avr_boot_atmega1284.menu.pinout.wirings.build.variant=WiringS
avr_boot_atmega1284.menu.pinout.wirings.build.board=WIRING_S
avr_boot_atmega1284.menu.pinout.wirings.variant_id=5

avr_boot_atmega1284.menu.pinout.playshield=Wiring Play Shield
avr_boot_atmega1284.menu.pinout.playshield.build.variant=WiringSPlayShield
avr_boot_atmega1284.menu.pinout.playshield.build.board=WIRING_PLAY_SHIELD
avr_boot_atmega1284.menu.pinout.playshield.variant_id=6

# The following pinouts require the installation of Mighty 1284P https://github.com/JChristensen/mighty-1284p/tree/v1.6.3)

avr_boot_atmega1284.menu.pinout.standard=Standard(requires Mighty 1284P): Mighty 1284P/Mighty Mini 1284P
avr_boot_atmega1284.menu.pinout.standard.build.variant=mighty-1284p:standard
avr_boot_atmega1284.menu.pinout.standard.build.board=1284P_STANDARD
avr_boot_atmega1284.menu.pinout.standard.variant_id=0

avr_boot_atmega1284.menu.pinout.bobuino=Bobuino(requires Mighty 1284P): Bobuino/Skinny Bob
avr_boot_atmega1284.menu.pinout.bobuino.build.variant=mighty-1284p:bobuino
avr_boot_atmega1284.menu.pinout.bobuino.build.board=1284P_BOBUINO
avr_boot_atmega1284.menu.pinout.bobuino.variant_id=1

avr_boot_atmega1284.menu.pinout.sleepingbeauty=Sleeping Beauty(requires Mighty 1284P)
avr_boot_atmega1284.menu.pinout.sleepingbeauty.build.variant=mighty-1284p:sleepingbeauty
avr_boot_atmega1284.menu.pinout.sleepingbeauty.build.board=1284P_SLEEPINGBEAUTY
avr_boot_atmega1284.menu.pinout.sleepingbeauty.variant_id=2

# Clock Menu
avr_boot_atmega1284.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega1284.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega1284.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

avr_boot_atmega1284.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega1284.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega1284.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega1284.menu.clock.20mhz=20MHz External
avr_boot_atmega1284.menu.clock.20mhz.bootloader.low_fuses=0xF7
avr_boot_atmega1284.menu.clock.20mhz.build.f_cpu=20000000L

avr_boot_atmega1284.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega1284.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega1284.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega1284.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega1284.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega1284.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega1284.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega1284.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega1284.menu.clock.8mhz_internal.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega1284.menu.SDCS.4=4
avr_boot_atmega1284.menu.SDCS.4.cs_pin=4

