zevero/avr_boot/avr/boards.txt
avr_boot_atmega1284.menu.SDCS.8=8
avr_boot_atmega1284.menu.SDCS.8.cs_pin=8

avr_boot_atmega1284.menu.SDCS.10=10
avr_boot_atmega1284.menu.SDCS.10.cs_pin=10

# BOD Menu
avr_boot_atmega1284.menu.BOD.2_7=2.7V
avr_boot_atmega1284.menu.BOD.2_7.bootloader.extended_fuses=0xFD

avr_boot_atmega1284.menu.BOD.4_3=4.3V
avr_boot_atmega1284.menu.BOD.4_3.bootloader.extended_fuses=0xFC

avr_boot_atmega1284.menu.BOD.1_8=1.8V
avr_boot_atmega1284.menu.BOD.1_8.bootloader.extended_fuses=0xFE

avr_boot_atmega1284.menu.BOD.off=Off
avr_boot_atmega1284.menu.BOD.off.bootloader.extended_fuses=0xFF

avr_boot_atmega1284.bootloader.file={build.mcu}_v{variant_id}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

avr_boot_atmega644.name=ATmega644/P/A/PA

avr_boot_atmega644.upload.tool=arduino:avrdude
avr_boot_atmega644.upload.maximum_data_size=4096
avr_boot_atmega644.upload.maximum_size=61440

avr_boot_atmega644.bootloader.tool=arduino:avrdude
avr_boot_atmega644.bootloader.high_fuses=0xDA
avr_boot_atmega644.bootloader.unlock_bits=0x3F
avr_boot_atmega644.bootloader.lock_bits=0x0F

avr_boot_atmega644.build.core=arduino:arduino
avr_boot_atmega644.build.board=AVR_ATMEGA644

# Processor Menu
avr_boot_atmega644.menu.cpu.atmega644=ATmega644
avr_boot_atmega644.menu.cpu.atmega644.build.mcu=atmega644

avr_boot_atmega644.menu.cpu.atmega644p=ATmega644P
avr_boot_atmega644.menu.cpu.atmega644p.build.mcu=atmega644p

avr_boot_atmega644.menu.cpu.atmega644a=ATmega644A
avr_boot_atmega644.menu.cpu.atmega644a.build.mcu=atmega644a

avr_boot_atmega644.menu.cpu.atmega644pa=ATmega644PA
avr_boot_atmega644.menu.cpu.atmega644pa.build.mcu=atmega644pa

# Pinout Menu
avr_boot_atmega644.menu.pinout.avrdevelopers=avr-developers.com
avr_boot_atmega644.menu.pinout.avrdevelopers.build.variant=avr_developers
avr_boot_atmega644.menu.pinout.avrdevelopers.build.board=1284P_AVR_DEVELOPERS
avr_boot_atmega644.menu.pinout.avrdevelopers.variant_id=0

avr_boot_atmega644.menu.pinout.calunium_pcb=Calunium PCB
avr_boot_atmega644.menu.pinout.calunium_pcb.build.variant=calunium-pcb
avr_boot_atmega644.menu.pinout.calunium_pcb.build.board=AVR_CALUNIUM
avr_boot_atmega644.menu.pinout.calunium_pcb.variant_id=2

avr_boot_atmega644.menu.pinout.calunium_stripboard=Calunium Stripboard
avr_boot_atmega644.menu.pinout.calunium_stripboard.build.variant=calunium-stripboard
avr_boot_atmega644.menu.pinout.calunium_stripboard.build.board=AVR_CALUNIUM
avr_boot_atmega644.menu.pinout.calunium_stripboard.variant_id=2

avr_boot_atmega644.menu.pinout.goldilocks=Goldilocks v1.1/Analogue
avr_boot_atmega644.menu.pinout.goldilocks.build.variant=goldilocks
avr_boot_atmega644.menu.pinout.goldilocks.build.board=AVR_GOLDILOCKS
avr_boot_atmega644.menu.pinout.goldilocks.variant_id=3

avr_boot_atmega644.menu.pinout.wildfirev2=WildFire v2
avr_boot_atmega644.menu.pinout.wildfirev2.build.variant=wildfirev2
avr_boot_atmega644.menu.pinout.wildfirev2.build.board=WILDFIRE_V2
avr_boot_atmega644.menu.pinout.wildfirev2.variant_id=3

avr_boot_atmega644.menu.pinout.wildfirev3=WildFire v3
avr_boot_atmega644.menu.pinout.wildfirev3.build.variant=wildfirev3
avr_boot_atmega644.menu.pinout.wildfirev3.build.board=WILDFIRE_V3
avr_boot_atmega644.menu.pinout.wildfirev3.variant_id=4

avr_boot_atmega644.menu.pinout.wirings=Wiring S
avr_boot_atmega644.menu.pinout.wirings.build.variant=WiringS
avr_boot_atmega644.menu.pinout.wirings.build.board=WIRING_S
avr_boot_atmega644.menu.pinout.wirings.variant_id=5

avr_boot_atmega644.menu.pinout.playshield=Wiring Play Shield
avr_boot_atmega644.menu.pinout.playshield.build.variant=WiringSPlayShield
avr_boot_atmega644.menu.pinout.playshield.build.board=WIRING_PLAY_SHIELD
avr_boot_atmega644.menu.pinout.playshield.variant_id=6

# The following pinouts require the installation of MightyCore https://github.com/MCUdude/MightyCore

avr_boot_atmega644.menu.pinout.standard=Standard(requires MightyCore)
avr_boot_atmega644.menu.pinout.standard.build.variant=MightyCore:standard
avr_boot_atmega644.menu.pinout.standard.build.board=1284P_STANDARD
avr_boot_atmega644.menu.pinout.standard.variant_id=0

avr_boot_atmega644.menu.pinout.bobuino=Bobuino(requires MightyCore)
avr_boot_atmega644.menu.pinout.bobuino.build.variant=MightyCore:bobuino
avr_boot_atmega644.menu.pinout.bobuino.build.board=1284P_BOBUINO
avr_boot_atmega644.menu.pinout.bobuino.variant_id=1

# Clock Menu
avr_boot_atmega644.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega644.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega644.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

avr_boot_atmega644.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega644.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega644.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega644.menu.clock.20mhz=20MHz External
avr_boot_atmega644.menu.clock.20mhz.bootloader.low_fuses=0xF7
avr_boot_atmega644.menu.clock.20mhz.build.f_cpu=20000000L

avr_boot_atmega644.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega644.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega644.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega644.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega644.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega644.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega644.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega644.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega644.menu.clock.8mhz_internal.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega644.menu.SDCS.4=4
avr_boot_atmega644.menu.SDCS.4.cs_pin=4

avr_boot_atmega644.menu.SDCS.8=8
avr_boot_atmega644.menu.SDCS.8.cs_pin=8

avr_boot_atmega644.menu.SDCS.10=10
avr_boot_atmega644.menu.SDCS.10.cs_pin=10

# BOD Menu
avr_boot_atmega644.menu.BOD.2_7=2.7V
avr_boot_atmega644.menu.BOD.2_7.bootloader.extended_fuses=0xFD

avr_boot_atmega644.menu.BOD.4_3=4.3V
avr_boot_atmega644.menu.BOD.4_3.bootloader.extended_fuses=0xFC

