zevero/avr_boot/avr/boards.txt
# Pinout Menu
avr_boot_atmega32.menu.pinout.avrdevelopers=avr-developers.com
avr_boot_atmega32.menu.pinout.avrdevelopers.build.variant=avr_developers
avr_boot_atmega32.menu.pinout.avrdevelopers.build.board=1284P_AVR_DEVELOPERS
avr_boot_atmega32.menu.pinout.avrdevelopers.variant_id=0

avr_boot_atmega32.menu.pinout.calunium_pcb=Calunium PCB
avr_boot_atmega32.menu.pinout.calunium_pcb.build.variant=calunium-pcb
avr_boot_atmega32.menu.pinout.calunium_pcb.build.board=AVR_CALUNIUM
avr_boot_atmega32.menu.pinout.calunium_pcb.variant_id=2

avr_boot_atmega32.menu.pinout.calunium_stripboard=Calunium Stripboard
avr_boot_atmega32.menu.pinout.calunium_stripboard.build.variant=calunium-stripboard
avr_boot_atmega32.menu.pinout.calunium_stripboard.build.board=AVR_CALUNIUM
avr_boot_atmega32.menu.pinout.calunium_stripboard.variant_id=2

avr_boot_atmega32.menu.pinout.goldilocks=Goldilocks v1.1/Analogue
avr_boot_atmega32.menu.pinout.goldilocks.build.variant=goldilocks
avr_boot_atmega32.menu.pinout.goldilocks.build.board=AVR_GOLDILOCKS
avr_boot_atmega32.menu.pinout.goldilocks.variant_id=3

avr_boot_atmega32.menu.pinout.wildfirev2=WildFire v2
avr_boot_atmega32.menu.pinout.wildfirev2.build.variant=wildfirev2
avr_boot_atmega32.menu.pinout.wildfirev2.build.board=WILDFIRE_V2
avr_boot_atmega32.menu.pinout.wildfirev2.variant_id=3

avr_boot_atmega32.menu.pinout.wildfirev3=WildFire v3
avr_boot_atmega32.menu.pinout.wildfirev3.build.variant=wildfirev3
avr_boot_atmega32.menu.pinout.wildfirev3.build.board=WILDFIRE_V3
avr_boot_atmega32.menu.pinout.wildfirev3.variant_id=4

avr_boot_atmega32.menu.pinout.wirings=Wiring S
avr_boot_atmega32.menu.pinout.wirings.build.variant=WiringS
avr_boot_atmega32.menu.pinout.wirings.build.board=WIRING_S
avr_boot_atmega32.menu.pinout.wirings.variant_id=5

avr_boot_atmega32.menu.pinout.playshield=Wiring Play Shield
avr_boot_atmega32.menu.pinout.playshield.build.variant=WiringSPlayShield
avr_boot_atmega32.menu.pinout.playshield.build.board=WIRING_PLAY_SHIELD
avr_boot_atmega32.menu.pinout.playshield.variant_id=6

# The following pinouts require the installation of MightyCore https://github.com/MCUdude/MightyCore

avr_boot_atmega32.menu.pinout.standard=Standard(requires MightyCore)
avr_boot_atmega32.menu.pinout.standard.build.variant=MightyCore:standard
avr_boot_atmega32.menu.pinout.standard.build.board=1284P_STANDARD
avr_boot_atmega32.menu.pinout.standard.variant_id=0

avr_boot_atmega32.menu.pinout.bobuino=Bobuino(requires MightyCore)
avr_boot_atmega32.menu.pinout.bobuino.build.variant=MightyCore:bobuino
avr_boot_atmega32.menu.pinout.bobuino.build.board=1284P_BOBUINO
avr_boot_atmega32.menu.pinout.bobuino.variant_id=1

# Clock Menu
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod27=16MHz External Full Swing, 2.7V BOD
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod27.bootloader.low_fuses=0x9F
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod27.bootloader.high_fuses=0xC8
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod27.build.f_cpu=16000000L

avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod4=16MHz External Full Swing, 4.0V BOD
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod4.bootloader.low_fuses=0x1F
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod4.bootloader.high_fuses=0xC8
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bod4.build.f_cpu=16000000L

avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bodoff=16MHz External Full Swing, BOD Off
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bodoff.bootloader.low_fuses=0xFF
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bodoff.bootloader.high_fuses=0xC8
avr_boot_atmega32.menu.clock_bod.16mhz_full_swing_bodoff.build.f_cpu=16000000L

avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod27=16MHz External Low Power, 2.7V BOD
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod27.bootloader.low_fuses=0x9F
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod27.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod27.build.f_cpu=16000000L

avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod4=16MHz External Low Power, 4.0V BOD
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod4.bootloader.low_fuses=0x1F
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod4.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bod4.build.f_cpu=16000000L

avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bodoff=16MHz External Low Power, BOD Off
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bodoff.bootloader.low_fuses=0xFF
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bodoff.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.16mhz_low_power_bodoff.build.f_cpu=16000000L

avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod27=8MHz External Full Swing, 2.7V BOD
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod27.bootloader.low_fuses=0x9F
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod27.bootloader.high_fuses=0xC8
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod27.build.f_cpu=8000000L

avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod4=8MHz External Full Swing, 4.0V BOD
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod4.bootloader.low_fuses=0x1F
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod4.bootloader.high_fuses=0xC8
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bod4.build.f_cpu=8000000L

avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bodoff=8MHz External Full Swing, BOD Off
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bodoff.bootloader.low_fuses=0xFF
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bodoff.bootloader.high_fuses=0xC8
avr_boot_atmega32.menu.clock_bod.8mhz_full_swing_bodoff.build.f_cpu=8000000L

avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod27=8MHz External Low Power, 2.7V BOD
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod27.bootloader.low_fuses=0x9F
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod27.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod27.build.f_cpu=8000000L

avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod4=8MHz External Low Power, 4.0V BOD
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod4.bootloader.low_fuses=0x1F
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod4.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bod4.build.f_cpu=8000000L

avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bodoff=8MHz External Low Power, BOD Off
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bodoff.bootloader.low_fuses=0xFF
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bodoff.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.8mhz_low_power_bodoff.build.f_cpu=8000000L

