zevero/avr_boot/avr/boards.txt
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod27=8MHz Internal, 2.7V BOD
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod27.bootloader.low_fuses=0x84
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod27.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod27.build.f_cpu=8000000L

avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod4=8MHz Internal, 4.0V BOD
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod4.bootloader.low_fuses=0x04
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod4.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bod4.build.f_cpu=8000000L

avr_boot_atmega32.menu.clock_bod.8mhz_internal_bodoff=8MHz Internal, BOD Off
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bodoff.bootloader.low_fuses=0xE4
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bodoff.bootloader.high_fuses=0xD8
avr_boot_atmega32.menu.clock_bod.8mhz_internal_bodoff.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega32.menu.SDCS.4=4
avr_boot_atmega32.menu.SDCS.4.cs_pin=4

avr_boot_atmega32.menu.SDCS.8=8
avr_boot_atmega32.menu.SDCS.8.cs_pin=8

avr_boot_atmega32.menu.SDCS.10=10
avr_boot_atmega32.menu.SDCS.10.cs_pin=10

avr_boot_atmega32.bootloader.file={build.mcu}_v{variant_id}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

avr_boot_atmega1281.name=ATmega1281

avr_boot_atmega1281.upload.tool=arduino:avrdude
avr_boot_atmega1281.upload.maximum_data_size=8192
avr_boot_atmega1281.upload.maximum_size=126976

avr_boot_atmega1281.bootloader.tool=arduino:avrdude
avr_boot_atmega1281.bootloader.high_fuses=0xDA
avr_boot_atmega1281.bootloader.unlock_bits=0x3F
avr_boot_atmega1281.bootloader.lock_bits=0x0F

avr_boot_atmega1281.build.core=arduino:arduino
avr_boot_atmega1281.build.board=AVR_ATMEGA1281
avr_boot_atmega1281.build.mcu=atmega1281

# Pinout Menu
avr_boot_atmega1281.menu.pinout.megacore_standard=MegaCore
avr_boot_atmega1281.menu.pinout.megacore_standard.build.variant=megacore-standard
avr_boot_atmega1281.menu.pinout.megacore_standard.build.board=AVR_MEGACORE
avr_boot_atmega1281.menu.pinout.megacore_standard.variant_id=0

avr_boot_atmega1281.menu.pinout.wiring1=Wiring 1.1
avr_boot_atmega1281.menu.pinout.wiring1.build.variant=Wiring1
avr_boot_atmega1281.menu.pinout.wiring1.build.board=WIRING1
avr_boot_atmega1281.menu.pinout.wiring1.variant_id=1

# Clock Menu
avr_boot_atmega1281.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega1281.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega1281.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

avr_boot_atmega1281.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega1281.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega1281.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega1281.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega1281.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega1281.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega1281.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega1281.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega1281.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega1281.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega1281.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega1281.menu.clock.8mhz_internal.build.f_cpu=8000000L

# BOD Menu
avr_boot_atmega1281.menu.BOD.2_7=2.7V
avr_boot_atmega1281.menu.BOD.2_7.bootloader.extended_fuses=0xFD

avr_boot_atmega1281.menu.BOD.4_3=4.3V
avr_boot_atmega1281.menu.BOD.4_3.bootloader.extended_fuses=0xFC

avr_boot_atmega1281.menu.BOD.1_8=1.8V
avr_boot_atmega1281.menu.BOD.1_8.bootloader.extended_fuses=0xFE

avr_boot_atmega1281.menu.BOD.off=Off
avr_boot_atmega1281.menu.BOD.off.bootloader.extended_fuses=0xFF

# SD CS Pin Menu
avr_boot_atmega1281.menu.SDCS.4=4
avr_boot_atmega1281.menu.SDCS.4.cs_pin=4

avr_boot_atmega1281.menu.SDCS.8=8
avr_boot_atmega1281.menu.SDCS.8.cs_pin=8

avr_boot_atmega1281.bootloader.file={build.mcu}_v{variant_id}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

avr_boot_atmega128.name=ATmega128/A

avr_boot_atmega128.upload.tool=arduino:avrdude
avr_boot_atmega128.upload.maximum_data_size=4096
avr_boot_atmega128.upload.maximum_size=126796

avr_boot_atmega128.bootloader.tool=arduino:avrdude
avr_boot_atmega128.bootloader.extended_fuses=0xFF
avr_boot_atmega128.bootloader.unlock_bits=0x3F
avr_boot_atmega128.bootloader.lock_bits=0x0F

avr_boot_atmega128.build.core=arduino:arduino
avr_boot_atmega128.build.board=AVR_ATMEGA128

# Processor Menu
avr_boot_atmega128.menu.cpu.atmega128=ATmega128
avr_boot_atmega128.menu.cpu.atmega128.build.mcu=atmega128

avr_boot_atmega128.menu.cpu.atmega128a=ATmega128A
avr_boot_atmega128.menu.cpu.atmega128a.build.mcu=atmega128a

# Pinout Menu
avr_boot_atmega128.menu.pinout.megacore_standard=MegaCore
avr_boot_atmega128.menu.pinout.megacore_standard.build.variant=megacore-standard
avr_boot_atmega128.menu.pinout.megacore_standard.build.board=AVR_MEGACORE
avr_boot_atmega128.menu.pinout.megacore_standard.variant_id=0

avr_boot_atmega128.menu.pinout.wiring1=Wiring 1.0
avr_boot_atmega128.menu.pinout.wiring1.build.variant=Wiring1
avr_boot_atmega128.menu.pinout.wiring1.build.board=WIRING1
avr_boot_atmega128.menu.pinout.wiring1.variant_id=1

# Clock/BOD Menu
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod27=16MHz External Full Swing, 2.7V BOD
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod27.bootloader.low_fuses=0x9F
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod27.bootloader.high_fuses=0xCA
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod27.build.f_cpu=16000000L

avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod40=16MHz External Full Swing, 4.0V BOD
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod40.bootloader.low_fuses=0x1F
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod40.bootloader.high_fuses=0xCA
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bod40.build.f_cpu=16000000L

avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bodoff=16MHz External Full Swing, BOD Off
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bodoff.bootloader.low_fuses=0xFF
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bodoff.bootloader.high_fuses=0xCA
avr_boot_atmega128.menu.clock_bod.16mhz_full_swing_bodoff.build.f_cpu=16000000L

avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod27=16MHz External Low Power, 2.7V BOD
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod27.bootloader.low_fuses=0x9F
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod27.bootloader.high_fuses=0xDA
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod27.build.f_cpu=16000000L

avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod40=16MHz External Low Power, 4.0V BOD
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod40.bootloader.low_fuses=0x1F
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod40.bootloader.high_fuses=0xDA
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bod40.build.f_cpu=16000000L

avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bodoff=16MHz External Low Power, BOD Off
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bodoff.bootloader.low_fuses=0xFF
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bodoff.bootloader.high_fuses=0xDA
avr_boot_atmega128.menu.clock_bod.16mhz_low_power_bodoff.build.f_cpu=16000000L

avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod27=8MHz External Full Swing, 2.7V BOD
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod27.bootloader.low_fuses=0x9F
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod27.bootloader.high_fuses=0xCA
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod27.build.f_cpu=8000000L

avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod40=8MHz External Full Swing, 4.0V BOD
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod40.bootloader.low_fuses=0x1F
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod40.bootloader.high_fuses=0xCA
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bod40.build.f_cpu=8000000L

avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bodoff=8MHz External Full Swing, BOD Off
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bodoff.bootloader.low_fuses=0xFF
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bodoff.bootloader.high_fuses=0xCA
avr_boot_atmega128.menu.clock_bod.8mhz_full_swing_bodoff.build.f_cpu=8000000L

