zevero/avr_boot/avr/boards.txt
##############################################################

avr_boot_atmega1280.name=ATmega1280

avr_boot_atmega1280.upload.tool=arduino:avrdude
avr_boot_atmega1280.upload.maximum_data_size=8192
avr_boot_atmega1280.upload.maximum_size=126976

avr_boot_atmega1280.bootloader.tool=arduino:avrdude
avr_boot_atmega1280.bootloader.high_fuses=0xDA
avr_boot_atmega1280.bootloader.unlock_bits=0x3F
avr_boot_atmega1280.bootloader.lock_bits=0x0F

avr_boot_atmega1280.build.mcu=atmega1280
avr_boot_atmega1280.build.core=arduino:arduino
avr_boot_atmega1280.build.variant=arduino:mega
avr_boot_atmega1280.build.board=AVR_MEGA1280

# Clock Menu
avr_boot_atmega1280.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega1280.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega1280.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega1280.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega1280.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega1280.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

avr_boot_atmega1280.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega1280.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega1280.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega1280.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega1280.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega1280.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega1280.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega1280.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega1280.menu.clock.8mhz_internal.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega1280.menu.SDCS.4=4
avr_boot_atmega1280.menu.SDCS.4.cs_pin=4

# avr_boot_atmega1280.menu.SDCS.8=8
# avr_boot_atmega1280.menu.SDCS.8.cs_pin=8

avr_boot_atmega1280.menu.SDCS.10=10
avr_boot_atmega1280.menu.SDCS.10.cs_pin=10

avr_boot_atmega1280.menu.SDCS.53=53
avr_boot_atmega1280.menu.SDCS.53.cs_pin=53

# BOD Menu
avr_boot_atmega1280.menu.BOD.2_7=2.7V
avr_boot_atmega1280.menu.BOD.2_7.bootloader.extended_fuses=0xFD

avr_boot_atmega1280.menu.BOD.4_3=4.3V
avr_boot_atmega1280.menu.BOD.4_3.bootloader.extended_fuses=0xFC

avr_boot_atmega1280.menu.BOD.1_8=1.8V
avr_boot_atmega1280.menu.BOD.1_8.bootloader.extended_fuses=0xFE

avr_boot_atmega1280.menu.BOD.off=Off
avr_boot_atmega1280.menu.BOD.off.bootloader.extended_fuses=0xFF

avr_boot_atmega1280.bootloader.file={build.mcu}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

avr_boot_atmega640.name=ATmega640

avr_boot_atmega640.upload.tool=arduino:avrdude
avr_boot_atmega640.upload.maximum_data_size=8192
avr_boot_atmega640.upload.maximum_size=61440

avr_boot_atmega640.bootloader.tool=arduino:avrdude
avr_boot_atmega640.bootloader.high_fuses=0xDA
avr_boot_atmega640.bootloader.unlock_bits=0x3F
avr_boot_atmega640.bootloader.lock_bits=0x0F

avr_boot_atmega640.build.mcu=atmega640
avr_boot_atmega640.build.core=arduino:arduino
avr_boot_atmega640.build.variant=arduino:mega
avr_boot_atmega640.build.board=AVR_MEGA640

# Clock Menu
avr_boot_atmega640.menu.clock.16mhz_low_power=16MHz External Low Power
avr_boot_atmega640.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega640.menu.clock.16mhz_low_power.build.f_cpu=16000000L

avr_boot_atmega640.menu.clock.16mhz_full_swing=16MHz External Full Swing
avr_boot_atmega640.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega640.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

avr_boot_atmega640.menu.clock.8mhz_low_power=8MHz External Low Power
avr_boot_atmega640.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
avr_boot_atmega640.menu.clock.8mhz_low_power.build.f_cpu=8000000L

avr_boot_atmega640.menu.clock.8mhz_full_swing=8MHz External Full Swing
avr_boot_atmega640.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
avr_boot_atmega640.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

avr_boot_atmega640.menu.clock.8mhz_internal=8MHz Internal
avr_boot_atmega640.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
avr_boot_atmega640.menu.clock.8mhz_internal.build.f_cpu=8000000L

# SD CS Pin Menu
avr_boot_atmega640.menu.SDCS.4=4
avr_boot_atmega640.menu.SDCS.4.cs_pin=4

# avr_boot_atmega640.menu.SDCS.8=8
# avr_boot_atmega640.menu.SDCS.8.cs_pin=8

avr_boot_atmega640.menu.SDCS.10=10
avr_boot_atmega640.menu.SDCS.10.cs_pin=10

avr_boot_atmega640.menu.SDCS.53=53
avr_boot_atmega640.menu.SDCS.53.cs_pin=53

# BOD Menu
avr_boot_atmega640.menu.BOD.2_7=2.7V
avr_boot_atmega640.menu.BOD.2_7.bootloader.extended_fuses=0xFD

avr_boot_atmega640.menu.BOD.4_3=4.3V
avr_boot_atmega640.menu.BOD.4_3.bootloader.extended_fuses=0xFC

avr_boot_atmega640.menu.BOD.1_8=1.8V
avr_boot_atmega640.menu.BOD.1_8.bootloader.extended_fuses=0xFE

avr_boot_atmega640.menu.BOD.off=Off
avr_boot_atmega640.menu.BOD.off.bootloader.extended_fuses=0xFF

avr_boot_atmega640.bootloader.file={build.mcu}_cs{cs_pin}_{build.f_cpu}.hex

##############################################################

# avr_boot_atmega2560.name=ATmega2560

# avr_boot_atmega2560.upload.tool=arduino:avrdude
# avr_boot_atmega2560.upload.maximum_data_size=8192
# avr_boot_atmega2560.upload.maximum_size=258048

# avr_boot_atmega2560.bootloader.tool=arduino:avrdude
# avr_boot_atmega2560.bootloader.high_fuses=0xDA
# avr_boot_atmega2560.bootloader.unlock_bits=0x3F
# avr_boot_atmega2560.bootloader.lock_bits=0x0F

# avr_boot_atmega2560.build.mcu=atmega2560
# avr_boot_atmega2560.build.core=arduino:arduino
# avr_boot_atmega2560.build.variant=arduino:mega
# avr_boot_atmega2560.build.board=AVR_MEGA2560

# # Clock Menu
# avr_boot_atmega2560.menu.clock.16mhz_low_power=16MHz External Low Power
# avr_boot_atmega2560.menu.clock.16mhz_low_power.bootloader.low_fuses=0xFF
# avr_boot_atmega2560.menu.clock.16mhz_low_power.build.f_cpu=16000000L

# avr_boot_atmega2560.menu.clock.16mhz_full_swing=16MHz External Full Swing
# avr_boot_atmega2560.menu.clock.16mhz_full_swing.bootloader.low_fuses=0xF7
# avr_boot_atmega2560.menu.clock.16mhz_full_swing.build.f_cpu=16000000L

# avr_boot_atmega2560.menu.clock.8mhz_low_power=8MHz External Low Power
# avr_boot_atmega2560.menu.clock.8mhz_low_power.bootloader.low_fuses=0xFF
# avr_boot_atmega2560.menu.clock.8mhz_low_power.build.f_cpu=8000000L

# avr_boot_atmega2560.menu.clock.8mhz_full_swing=8MHz External Full Swing
# avr_boot_atmega2560.menu.clock.8mhz_full_swing.bootloader.low_fuses=0xF7
# avr_boot_atmega2560.menu.clock.8mhz_full_swing.build.f_cpu=8000000L

# avr_boot_atmega2560.menu.clock.8mhz_internal=8MHz Internal
# avr_boot_atmega2560.menu.clock.8mhz_internal.bootloader.low_fuses=0xE2
# avr_boot_atmega2560.menu.clock.8mhz_internal.build.f_cpu=8000000L

# # SD CS Pin Menu
# avr_boot_atmega2560.menu.SDCS.4=4
# avr_boot_atmega2560.menu.SDCS.4.cs_pin=4

# avr_boot_atmega2560.menu.SDCS.8=8
# avr_boot_atmega2560.menu.SDCS.8.cs_pin=8

# avr_boot_atmega2560.menu.SDCS.10=10
# avr_boot_atmega2560.menu.SDCS.10.cs_pin=10

# avr_boot_atmega2560.menu.SDCS.53=53
# avr_boot_atmega2560.menu.SDCS.53.cs_pin=53

# # BOD Menu
# avr_boot_atmega2560.menu.BOD.2_7=2.7V
# avr_boot_atmega2560.menu.BOD.2_7.bootloader.extended_fuses=0xFD

# avr_boot_atmega2560.menu.BOD.4_3=4.3V
# avr_boot_atmega2560.menu.BOD.4_3.bootloader.extended_fuses=0xFC

# avr_boot_atmega2560.menu.BOD.1_8=1.8V
# avr_boot_atmega2560.menu.BOD.1_8.bootloader.extended_fuses=0xFE

# avr_boot_atmega2560.menu.BOD.off=Off
# avr_boot_atmega2560.menu.BOD.off.bootloader.extended_fuses=0xFF

# avr_boot_atmega2560.bootloader.file={build.mcu}_cs{cs_pin}_{build.f_cpu}.hex
